### Importando Bibliotecas

In [ ]:
import sqlite3

### Fazendo a conexão

In [ ]:
conexao = sqlite3.connect('Banco')
cursor = conexao.cursor()

### 1- Criando a tabela Alunos

In [ ]:
cursor.execute('CREATE TABLE alunos (Id INT, Nome VARCHAR(100), Idade INT, Curso VARCHAR (100);')

### 2-  Inserindo Dados na Tabela

In [ ]:
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(1,"Renata","16","Inglês")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(2,"Carlos","18","Espanhol")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(3,"Bruna","20","Alemão")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(4,"Roberto","30","Japones")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(5,"Uriel","14","Espanhol")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(6,"Juliana","23","Inglês")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(7,"Claudia","25","Alemão")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(8,"Jaqueline","18","Inglês")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(9,"Beatriz","24","Inglês")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(10,"Luciana","20","Espanhol")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(11,"Juliano","23","Alemão")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(12,"Adriel","18","Espanhol")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(13,"Gustavo","15","Inglês")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(14,"Eduardo","18","Alemão")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(15,"Ariel","32","Japones")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(16,"Marcos","23","Inglês")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(17,"Jean","16","Espanhol")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(18,"Felipe","18","Alemão")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(19,"Raphael","24","Japones")')
cursor.execute('INSERT INTO alunos (Id,Nome,Idade,Curso) VALUES(20,"Marcio","20","Espanhol")')

conexao.commit()
conexao.close

### 3- Consultando uma Tabela

#### A - Selecionar todos os registros da tabela "alunos".

In [ ]:
dados = cursor.execute('SELECT * FROM alunos')
for alunos  in dados:
    print(alunos)

#### B - Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
dados2 = cursor.execute('SELECT Nome, Idade FROM alunos where Idade > 20')
for alunos  in dados2:
    print(alunos)

#### C - Selecionar os alunos do curso de "Engenharia" em ordem alfabética.

In [ ]:
dados = cursor.execute('SELECT * FROM alunos')
for alunos  in dados:
    print(alunos)

#### D - Contar o número total de alunos na tabela

In [ ]:
dados = cursor.execute('SELECT count(Id) FROM alunos')
for alunos  in dados:
    print(alunos)